In [2]:
import pandas as pd
import numpy as np

In [3]:
d1={"Company_name":["Apple","Microsoft","Walmart","Amazon","Samsung"],
    "Revenue":["$9168k","$8123k",pd.NaT, pd.NaT, "$5602"]
   }

In [4]:
d1

{'Company_name': ['Apple', 'Microsoft', 'Walmart', 'Amazon', 'Samsung'],
 'Revenue': ['$9168k', '$8123k', NaT, NaT, '$5602']}

In [5]:
df1=pd.DataFrame(d1)

In [6]:
print(df1)

  Company_name Revenue
0        Apple  $9168k
1    Microsoft  $8123k
2      Walmart     NaT
3       Amazon     NaT
4      Samsung   $5602

In [7]:
df1["Company_name"].dtype

dtype('O')

In [8]:
df1=df1.dropna() # it will delete all rows having NaN and NaT values

In [9]:
df1

  Company_name Revenue
0        Apple  $9168k
1    Microsoft  $8123k
4      Samsung   $5602

In [10]:
df1=df1.reset_index(drop=True)

In [11]:
df1

  Company_name Revenue
0        Apple  $9168k
1    Microsoft  $8123k
2      Samsung   $5602

In [12]:
df1["Revenue"].dtype

dtype('O')

In [13]:
df1["Code"]=[pd.NaT,pd.NaT,pd.NaT]

In [14]:
df1

  Company_name Revenue Code
0        Apple  $9168k  NaT
1    Microsoft  $8123k  NaT
2      Samsung   $5602  NaT

In [15]:
df2=df1.dropna(how="all", axis=1) #it will delete columns only if all have missing values

In [16]:
df2.reset_index()

   index Company_name Revenue
0      0        Apple  $9168k
1      1    Microsoft  $8123k
2      2      Samsung   $5602

In [17]:
df2.reset_index(drop=True)

  Company_name Revenue
0        Apple  $9168k
1    Microsoft  $8123k
2      Samsung   $5602

In [18]:
df2

  Company_name Revenue
0        Apple  $9168k
1    Microsoft  $8123k
2      Samsung   $5602

In [19]:
df2["Markest_value"]=["$12320k","$3893k",pd.NaT]

In [20]:
df2

  Company_name Revenue Markest_value
0        Apple  $9168k       $12320k
1    Microsoft  $8123k        $3893k
2      Samsung   $5602           NaT

In [21]:
df3=df2.dropna(how="any", axis=0) #delete any row having atleast one NaN value.

In [22]:
df3

  Company_name Revenue Markest_value
0        Apple  $9168k       $12320k
1    Microsoft  $8123k        $3893k

In [23]:
df3["Mas"]=["KAlu",pd.NaT]

/home/gambler/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [24]:
df3

  Company_name Revenue Markest_value   Mas
0        Apple  $9168k       $12320k  KAlu
1    Microsoft  $8123k        $3893k   NaT

In [28]:
df4=df3.dropna(subset=["Markest_value"], axis=0) #deleted row being last row market_value empty

In [29]:
df4

  Company_name Revenue Markest_value   Mas
0        Apple  $9168k       $12320k  KAlu
1    Microsoft  $8123k        $3893k   NaT

In [37]:
df4.dropna(subset=["Mas"], axis=0)

  Company_name Revenue Markest_value   Mas
0        Apple  $9168k       $12320k  KAlu